{"review": ["I stayed here with my wife for 1 night in September 2018.I booked a Queen room originally. Check in was from 3pm, but we arrived at 1pm, and went to the Sands Lounge, where we took a ticket and drank free tea/coffee until our number was called.The check in clerk offered me an upgrade, and I took it. It was worth every penny when my wife opened the door to suite 2406. The suite had two rooms, bay views from both rooms, huge bed and bathroom, as well as a dressing room.In room there was a nespresso machine, kettle and tea / coffee.The staff were helpful and pleasant, snd even though my birthday was 9 days away, they noted the date from my check-in information and sent birthday cake to my room!!The skypark was a nice place to relax and people-watch, although drinks are expensive compared to downtown. At night the views from the infinity pool are spectacular and not to be missed.It's a special place, and they make you feel special, so pay the money and treat yourself.", "We stayed here on our way to Thailand for 1 night. This hotel is stunning! It’s one of the iconic hotels of the world, a must see for everyone. Right in the heart of it all, shopping, restaurants, gardens by the bay, marina the list goes on. The rooms are massive with big bathrooms. We had a view of the gardens by the bay which are beautiful. There’s so much to see and do here! Only one thing we wasn’t to happy about, that was the beds. Ours was rather hard and not very comfy. But other then that what a hotel! ", "So this a review from someone who normally stays in simple accommodation but for our silver wedding anniversary we splashed out on 2 nights at MBS - best decision we made. We checked in early and our room was ready - a deluxe room on 25th floor of tower 3 with a magnificent view over the gardens at the bay. We of course got changed and headed straight up to the infinity pool which was as amazing as all the pictures portray. We were fascinated by the extreme measures taken for the perfect pose. We decided to treat ourselves to in room dining as we had such a magnificent view from our balcony. We had prawn and mango salad and smoked duck starter- both tasted fabulous and really big portions. For main we had fillet steak and rack of lamb again cooked to perfection. We had our meal while watching the gardens at the bay light show.I was slightly nervous staying here in case it was a bit pretentious - but it wasn’t.If you get the chance I would recommend staying here even if just for 1 night - it was an amazing experience.", "Checking in was pretty quick and hassle free on this occasion. We were offered a room on the 17th floor of Tower 1 with a city view. The room was spacious and well lit. Liked the firm mattress and pillows provided. These really helped in ensuring a good night's sleep. The view from the room was awesome. We could see the city skyline and some of the other iconic structures clearly from the room. Really enjoyed this recent staycation.", "I took this trip as a couple. \nAll employees are so kind and always smile.\nThe view was so beautiful\nA leisurely hotel is a hotel that gives you some peace of mind\nI can't forget the view from the pool.", "This is a beautiful hotel in a great location close to parks, restaurants and high end shopping. It is a very large hotel with some 2000 rooms and so breakfast is served in any one of 4 restaurant on the property but the pick for me was the roof top restaurant with magnificent views of Singapore. Whilst on breakfast, it was a full buffet with the addition of custom made eggs by the chefs on hand. A good variety of fruits, cereal, juices as well as Asian and Western breakfast offerings.For such a large hotel the service was superb but a quick note, if you plan on staying in a club room be aware that the size of the club room is a little disproportionate to the size of the hotel so you need to be there early to get a seat or wait until a table is ready.That said, the food and drinks at the club lounge were excellent and of high quality.The hotel also has a well equiped gym with change room facilities as well as a separate male/female sauna, steam room and spa.The hero of the hotel is however the roof top pool and facilities. The view from the pool is spectacular and the enough lounge chairs to cater for guests. Complimentary towels are also provided and they even have photographers in the pool who can take your photos with either their or your camera.The pool area is divided into adults only and a separate children's area so the hotel caters for couples as well as families.", "My (now) fiancé and I stayed here in July 2018. We had planned to stay in a different hotel but he was planning to propose in the Gardens by the Bay and splurged for us to spend a single night at the famous Marina Bay Sands. This hotel is by far the nicest hotel I've ever stayed at in my life and the experience was truly magical.After waiting in line to check in for about 30 minutes, our room was ready ahead of schedule and was immaculately clean and huge. We had a city view room on the 42nd floor. Our belongings were taken up to our room promptly and we left to explore the property and take a swim in the amazing infinity pool.The pool is exactly how you imagine it - it is clean and cool and packed with people but the view and the experience is amazing. Our pictures may be cliché but being in this famous pool was awesome and I'll never forget it.All I knew was that we had plans at the upscale C'est La Vie so we changed into our finest clothes and walked out to the Gardens by the Bay where my (now) fiancé proposed and had a professional photographer waiting for the moment. We had a small photoshoot around the grounds at the Gardens with the beautiful MBS in the background.Our dinner at C'est La Vie was delicious and they had reserved one of the best seats in the house for us. We had delicious food and even more delicious dessert. My only complaint was that the service was a little slow (but this seems to be the norm in countries other than the US) and we might have only noticed as we were excited for our friends and family in the US to wake up so we could share our news.When we got back to the room, our room was decked out in rose petals and had towel swans. It was cliché in the best way and I loved it. As for the bed, it was a little hard (most of the beds we slept in in Asia were more firm than we're used to) but otherwise we slept comfortably. The bathroom was immaculate and the amenities were very upscale (I usually don't bother to take hotel shampoo but this stuff was actually worth taking with you).Hands down this was one of the best hotels I've ever been fortunate enough to stay in and if the price is right for you, I highly recommend the whole experience.", "This hotel is great for first time travelling to Singapore, because it is close to all the attractions in the Marina Bay area, which include Garden By the Bay (+ Evening light show; it is so close you can come twice to see the garden during night time and day time, which both were great experiences), SkyPark look out deck (already in the hotel ), Merlion (within 20 minutes walk), Singapore Flyer, Casino (connected to the hotel), theaters on the Bay (under 10 minutes), Wonder Full light show, etc. If you are a first timer or have a short stay in Singapore, you may also want to eat or shop the stores unique to Singapore, and the shopping mall connecting the Marina Bay Sands has it all. Marina Bay Sands feels very much like a Vegas hotel, the grandiose design with connecting Casino, renowned restaurants, and lot of shopping makes me felt like I am in Vegas again. Our arrival was very early in the morning, and check in was at Tower 1 lobby. Staff were very friendly and welcoming at our arrival. Our room couldn't be ready in the AM, so they put our email address down, so they can contact us when the room was ready. The check in was very easy, later we found out there were 2 check in reception in the hotel, Tower 1 and Tower 3. Tower 3 reception is always busy, chaotic and dark (lack of natural light); especially during check out hours. I would suggest you check in at Tower 1 if you want to ensure a smooth experience. Tower 1 has the best views and also has most amenities connected directly to tower, follow by 2 and 3. I also suggest you ask for Tower 1 and also try to get suite on floor 34 and up. Although all 3 towers have access to the infinity pool; if you are on 34 or lower, you will have to transfer elevator. The highlight of the hotel obviously was the infinity pool and it was the sole reason we booked the hotel. The pool did not disappoint us. The access to the pool require one room card per person, so you will not be able to bring a guest. There is an adults area closer to the tower 3 entrance of the pool, and it is often quieter and has fewer people. We found the best time (least crowded) to go to the pool was mid afternoon (1-3pm), it is the hottest time of the day, and we find it has the least people. Otherwise, It is packed during the morning and evening time. The staffs at the pool area were all very friendly and helpful, they speak multiple languages and will chat with all guests. We had a great time at the pool. We also really like their gym, it has nice equipment and is facing the city side of the Bay and has a great view for a morning run. We are most disappointed, however, with the hotel room. It is not well maintained given its age (8 years). The furniture already started to show its age, and carpet and bathroom were not very clean. We did not feel it has any luxurious details given its price. Bottom line is, you must experience it once for the infinity pool, but would not come to stay just for the hotel.", "We stayed for one night before flying back home from a fantastic holiday. This hotel is out of this world. The staff are so friendly and helpful and as we booked a club room we had to check in at the Sands Lounge which was effortless. We were checked in by a lovely lady who was friendly and interested in our holiday and travels. Our room was amazing, we were upgraded to a city view and it was a great view from our room. There was everything we needed and wanted. The one complaint I would have if I am being picky is the bath towels were quite small and rough feeling. The infinity pool speaks for itself. The water was warm, we went up before sunset and stayed until it was dark to see the city come alive. I have heard that weekends are particularly busy, but as it was a weekday it was plenty of room around the pool, sun beds and hot tubs. We visited the Club 55 for evening drinks and canapés as part of the booking and experienced great food, views and friendly service with staff who were again happy to chat and get to know you. We used the express check out which was so easy. Overall luxury on a grand scale with service to be proud of. ", "one of the best hotels of the world it is a life experience an architectonik wonder inside and outside three separate buildings joined on the top with a huge rooftop on the rooftop there are restaurants gardens with trees waters and of course the infinity pool only for the residents you MUST swimm in this pool with the breathtaken view the lobby is fantastic the rooms are huge and nice in the evening they have a light show inside the sea unique the staff is like a very good mashine everybody knows very well what to do yes you have to go there", "This is a beautiful hotel in a great location close to parks, restaurants and high end shopping. It is a very large hotel with some 2000 rooms and so breakfast is served in any one of 4 restaurant on the property but the pick for me was the roof top restaurant with magnificent views of Singapore. Whilst on breakfast, it was a full buffet with the addition of custom made eggs by the chefs on hand. A good variety of fruits, cereal, juices as well as Asian and Western breakfast offerings.For such a large hotel the service was superb but a quick note, if you plan on staying in a club room be aware that the size of the club room is a little disproportionate to the size of the hotel so you need to be there early to get a seat or wait until a table is ready.That said, the food and drinks at the club lounge were excellent and of high quality.The hotel also has a well equiped gym with change room facilities as well as a separate male/female sauna, steam room and spa.The hero of the hotel is however the roof top pool and facilities. The view from the pool is spectacular and the enough lounge chairs to cater for guests. Complimentary towels are also provided and they even have photographers in the pool who can take your photos with either their or your camera.The pool area is divided into adults only and a separate children's area so the hotel caters for couples as well as families.", "My (now) fiancé and I stayed here in July 2018. We had planned to stay in a different hotel but he was planning to propose in the Gardens by the Bay and splurged for us to spend a single night at the famous Marina Bay Sands. This hotel is by far the nicest hotel I've ever stayed at in my life and the experience was truly magical.After waiting in line to check in for about 30 minutes, our room was ready ahead of schedule and was immaculately clean and huge. We had a city view room on the 42nd floor. Our belongings were taken up to our room promptly and we left to explore the property and take a swim in the amazing infinity pool.The pool is exactly how you imagine it - it is clean and cool and packed with people but the view and the experience is amazing. Our pictures may be cliché but being in this famous pool was awesome and I'll never forget it.All I knew was that we had plans at the upscale C'est La Vie so we changed into our finest clothes and walked out to the Gardens by the Bay where my (now) fiancé proposed and had a professional photographer waiting for the moment. We had a small photoshoot around the grounds at the Gardens with the beautiful MBS in the background.Our dinner at C'est La Vie was delicious and they had reserved one of the best seats in the house for us. We had delicious food and even more delicious dessert. My only complaint was that the service was a little slow (but this seems to be the norm in countries other than the US) and we might have only noticed as we were excited for our friends and family in the US to wake up so we could share our news.When we got back to the room, our room was decked out in rose petals and had towel swans. It was cliché in the best way and I loved it. As for the bed, it was a little hard (most of the beds we slept in in Asia were more firm than we're used to) but otherwise we slept comfortably. The bathroom was immaculate and the amenities were very upscale (I usually don't bother to take hotel shampoo but this stuff was actually worth taking with you).Hands down this was one of the best hotels I've ever been fortunate enough to stay in and if the price is right for you, I highly recommend the whole experience.", "This hotel is great for first time travelling to Singapore, because it is close to all the attractions in the Marina Bay area, which include Garden By the Bay (+ Evening light show; it is so close you can come twice to see the garden during night time and day time, which both were great experiences), SkyPark look out deck (already in the hotel ), Merlion (within 20 minutes walk), Singapore Flyer, Casino (connected to the hotel), theaters on the Bay (under 10 minutes), Wonder Full light show, etc. If you are a first timer or have a short stay in Singapore, you may also want to eat or shop the stores unique to Singapore, and the shopping mall connecting the Marina Bay Sands has it all. Marina Bay Sands feels very much like a Vegas hotel, the grandiose design with connecting Casino, renowned restaurants, and lot of shopping makes me felt like I am in Vegas again. Our arrival was very early in the morning, and check in was at Tower 1 lobby. Staff were very friendly and welcoming at our arrival. Our room couldn't be ready in the AM, so they put our email address down, so they can contact us when the room was ready. The check in was very easy, later we found out there were 2 check in reception in the hotel, Tower 1 and Tower 3. Tower 3 reception is always busy, chaotic and dark (lack of natural light); especially during check out hours. I would suggest you check in at Tower 1 if you want to ensure a smooth experience. Tower 1 has the best views and also has most amenities connected directly to tower, follow by 2 and 3. I also suggest you ask for Tower 1 and also try to get suite on floor 34 and up. Although all 3 towers have access to the infinity pool; if you are on 34 or lower, you will have to transfer elevator. The highlight of the hotel obviously was the infinity pool and it was the sole reason we booked the hotel. The pool did not disappoint us. The access to the pool require one room card per person, so you will not be able to bring a guest. There is an adults area closer to the tower 3 entrance of the pool, and it is often quieter and has fewer people. We found the best time (least crowded) to go to the pool was mid afternoon (1-3pm), it is the hottest time of the day, and we find it has the least people. Otherwise, It is packed during the morning and evening time. The staffs at the pool area were all very friendly and helpful, they speak multiple languages and will chat with all guests. We had a great time at the pool. We also really like their gym, it has nice equipment and is facing the city side of the Bay and has a great view for a morning run. We are most disappointed, however, with the hotel room. It is not well maintained given its age (8 years). The furniture already started to show its age, and carpet and bathroom were not very clean. We did not feel it has any luxurious details given its price. Bottom line is, you must experience it once for the infinity pool, but would not come to stay just for the hotel.", "We stayed for one night before flying back home from a fantastic holiday. This hotel is out of this world. The staff are so friendly and helpful and as we booked a club room we had to check in at the Sands Lounge which was effortless. We were checked in by a lovely lady who was friendly and interested in our holiday and travels. Our room was amazing, we were upgraded to a city view and it was a great view from our room. There was everything we needed and wanted. The one complaint I would have if I am being picky is the bath towels were quite small and rough feeling. The infinity pool speaks for itself. The water was warm, we went up before sunset and stayed until it was dark to see the city come alive. I have heard that weekends are particularly busy, but as it was a weekday it was plenty of room around the pool, sun beds and hot tubs. We visited the Club 55 for evening drinks and canapés as part of the booking and experienced great food, views and friendly service with staff who were again happy to chat and get to know you. We used the express check out which was so easy. Overall luxury on a grand scale with service to be proud of. ", "one of the best hotels of the world it is a life experience an architectonik wonder inside and outside three separate buildings joined on the top with a huge rooftop on the rooftop there are restaurants gardens with trees waters and of course the infinity pool only for the residents you MUST swimm in this pool with the breathtaken view the lobby is fantastic the rooms are huge and nice in the evening they have a light show inside the sea unique the staff is like a very good mashine everybody knows very well what to do yes you have to go there", "This is a beautiful hotel in a great location close to parks, restaurants and high end shopping. It is a very large hotel with some 2000 rooms and so breakfast is served in any one of 4 restaurant on the property but the pick for me was the roof top restaurant with magnificent views of Singapore. Whilst on breakfast, it was a full buffet with the addition of custom made eggs by the chefs on hand. A good variety of fruits, cereal, juices as well as Asian and Western breakfast offerings.For such a large hotel the service was superb but a quick note, if you plan on staying in a club room be aware that the size of the club room is a little disproportionate to the size of the hotel so you need to be there early to get a seat or wait until a table is ready.That said, the food and drinks at the club lounge were excellent and of high quality.The hotel also has a well equiped gym with change room facilities as well as a separate male/female sauna, steam room and spa.The hero of the hotel is however the roof top pool and facilities. The view from the pool is spectacular and the enough lounge chairs to cater for guests. Complimentary towels are also provided and they even have photographers in the pool who can take your photos with either their or your camera.The pool area is divided into adults only and a separate children's area so the hotel caters for couples as well as families.", "My (now) fiancé and I stayed here in July 2018. We had planned to stay in a different hotel but he was planning to propose in the Gardens by the Bay and splurged for us to spend a single night at the famous Marina Bay Sands. This hotel is by far the nicest hotel I've ever stayed at in my life and the experience was truly magical.After waiting in line to check in for about 30 minutes, our room was ready ahead of schedule and was immaculately clean and huge. We had a city view room on the 42nd floor. Our belongings were taken up to our room promptly and we left to explore the property and take a swim in the amazing infinity pool.The pool is exactly how you imagine it - it is clean and cool and packed with people but the view and the experience is amazing. Our pictures may be cliché but being in this famous pool was awesome and I'll never forget it.All I knew was that we had plans at the upscale C'est La Vie so we changed into our finest clothes and walked out to the Gardens by the Bay where my (now) fiancé proposed and had a professional photographer waiting for the moment. We had a small photoshoot around the grounds at the Gardens with the beautiful MBS in the background.Our dinner at C'est La Vie was delicious and they had reserved one of the best seats in the house for us. We had delicious food and even more delicious dessert. My only complaint was that the service was a little slow (but this seems to be the norm in countries other than the US) and we might have only noticed as we were excited for our friends and family in the US to wake up so we could share our news.When we got back to the room, our room was decked out in rose petals and had towel swans. It was cliché in the best way and I loved it. As for the bed, it was a little hard (most of the beds we slept in in Asia were more firm than we're used to) but otherwise we slept comfortably. The bathroom was immaculate and the amenities were very upscale (I usually don't bother to take hotel shampoo but this stuff was actually worth taking with you).Hands down this was one of the best hotels I've ever been fortunate enough to stay in and if the price is right for you, I highly recommend the whole experience.", "This hotel is great for first time travelling to Singapore, because it is close to all the attractions in the Marina Bay area, which include Garden By the Bay (+ Evening light show; it is so close you can come twice to see the garden during night time and day time, which both were great experiences), SkyPark look out deck (already in the hotel ), Merlion (within 20 minutes walk), Singapore Flyer, Casino (connected to the hotel), theaters on the Bay (under 10 minutes), Wonder Full light show, etc. If you are a first timer or have a short stay in Singapore, you may also want to eat or shop the stores unique to Singapore, and the shopping mall connecting the Marina Bay Sands has it all. Marina Bay Sands feels very much like a Vegas hotel, the grandiose design with connecting Casino, renowned restaurants, and lot of shopping makes me felt like I am in Vegas again. Our arrival was very early in the morning, and check in was at Tower 1 lobby. Staff were very friendly and welcoming at our arrival. Our room couldn't be ready in the AM, so they put our email address down, so they can contact us when the room was ready. The check in was very easy, later we found out there were 2 check in reception in the hotel, Tower 1 and Tower 3. Tower 3 reception is always busy, chaotic and dark (lack of natural light); especially during check out hours. I would suggest you check in at Tower 1 if you want to ensure a smooth experience. Tower 1 has the best views and also has most amenities connected directly to tower, follow by 2 and 3. I also suggest you ask for Tower 1 and also try to get suite on floor 34 and up. Although all 3 towers have access to the infinity pool; if you are on 34 or lower, you will have to transfer elevator. The highlight of the hotel obviously was the infinity pool and it was the sole reason we booked the hotel. The pool did not disappoint us. The access to the pool require one room card per person, so you will not be able to bring a guest. There is an adults area closer to the tower 3 entrance of the pool, and it is often quieter and has fewer people. We found the best time (least crowded) to go to the pool was mid afternoon (1-3pm), it is the hottest time of the day, and we find it has the least people. Otherwise, It is packed during the morning and evening time. The staffs at the pool area were all very friendly and helpful, they speak multiple languages and will chat with all guests. We had a great time at the pool. We also really like their gym, it has nice equipment and is facing the city side of the Bay and has a great view for a morning run. We are most disappointed, however, with the hotel room. It is not well maintained given its age (8 years). The furniture already started to show its age, and carpet and bathroom were not very clean. We did not feel it has any luxurious details given its price. Bottom line is, you must experience it once for the infinity pool, but would not come to stay just for the hotel.", "We stayed for one night before flying back home from a fantastic holiday. This hotel is out of this world. The staff are so friendly and helpful and as we booked a club room we had to check in at the Sands Lounge which was effortless. We were checked in by a lovely lady who was friendly and interested in our holiday and travels. Our room was amazing, we were upgraded to a city view and it was a great view from our room. There was everything we needed and wanted. The one complaint I would have if I am being picky is the bath towels were quite small and rough feeling. The infinity pool speaks for itself. The water was warm, we went up before sunset and stayed until it was dark to see the city come alive. I have heard that weekends are particularly busy, but as it was a weekday it was plenty of room around the pool, sun beds and hot tubs. We visited the Club 55 for evening drinks and canapés as part of the booking and experienced great food, views and friendly service with staff who were again happy to chat and get to know you. We used the express check out which was so easy. Overall luxury on a grand scale with service to be proud of. ", "one of the best hotels of the world it is a life experience an architectonik wonder inside and outside three separate buildings joined on the top with a huge rooftop on the rooftop there are restaurants gardens with trees waters and of course the infinity pool only for the residents you MUST swimm in this pool with the breathtaken view the lobby is fantastic the rooms are huge and nice in the evening they have a light show inside the sea unique the staff is like a very good mashine everybody knows very well what to do yes you have to go there"], "date": ["1 October 2018", "30 September 2018", "29 September 2018", "28 September 2018", "28 September 2018", "28 September 2018", "28 September 2018", "27 September 2018", "26 September 2018", "26 September 2018", "28 September 2018", "28 September 2018", "27 September 2018", "26 September 2018", "26 September 2018", "28 September 2018", "28 September 2018", "27 September 2018", "26 September 2018", "26 September 2018"], "country": ["London, England", "N.A.", "N.A.", "Singapore, Singapore", "N.A.", "N.A.", "Orange County, California", "Canada", "Huddersfield, United Kingdom", "athens hellas", "N.A.", "Orange County, California", "Canada", "Huddersfield, United Kingdom", "athens hellas", "N.A.", "Orange County, California", "Canada", "Huddersfield, United Kingdom", "athens hellas"], "rating": ["bubble_50", "bubble_40", "bubble_50", "bubble_40", "bubble_50", "bubble_50", "bubble_50", "bubble_40", "bubble_50", "bubble_50", "bubble_50", "bubble_50", "bubble_40", "bubble_50", "bubble_50", "bubble_50", "bubble_50", "bubble_40", "bubble_50", "bubble_50"]}